print('Шляпка гриба, покрытая (1)… кожиц(2)..й, держится на (3)… ножк(4).. . Снизу шляпка затянута (5)… плёнкой. Когда её уберёшь, откроется нижняя (6)… сторона шляпк(7).. .')

a = input('Заполните пропуск 1: ')
b = input('Заполните пропуск 2: ')
c = input('Заполните пропуск 3: ')
d = input('Заполните пропуск 4: ')
e = input('Заполните пропуск 5: ')
f = input('Заполните пропуск 6: ')
g = input('Заполните пропуск 7: ')

print('Шляпка гриба, покрытая', a, 'кожиц', b, 'й, держится на', c, 'ножк', d, '. Снизу шляпка затянута', e, 'плёнкой. Когда её уберёшь, откроется нижняя', f, 'сторона шляпк', g, '.')